eMujakic/stm32f407-drivers/Src/006SPI_arduino_TX.c
/*
 * @file		006SPI_arduino_TX_test.c
 * @author		ernad
 * @date 		Aug 12, 2026
 * @brief		3-Line SPI TX test with Arduino slave.
 *
 * @details
 * This application tests basic SPI-send functionality using an
 * an Arduino slave.
 */

#include <stdint.h>
#include "stm32f407xx.h"

#define SPI2_AF         GPIO_AF5
#define SPI2_PORT       GPIOB

#define SPI2_MOSI_PIN   GPIO_PIN_15   
#define SPI2_SCLK_PIN   GPIO_PIN_13
#define SPI2_NSS_PIN    GPIO_PIN_12

// GPIO port/pin of hardware button on STM32f407G Disc. Board
#define BUTTON_PORT		GPIOA
#define BUTTON_PIN		GPIO_PIN_0

static void delay(uint32_t val)
{
	for(uint32_t i = 0; i < val; i++);
}

// Initializes GPIO pins for SPI2 peripheral
static void gpio_init()
{
    GPIO_handle_t gpio_spi2;
    GPIO_ConfigInit(&gpio_spi2.GPIO_PinConfig);

    // MOSI
    gpio_spi2.pGPIOx = SPI2_PORT;
	gpio_spi2.GPIO_PinConfig.pinNumber      = SPI2_MOSI_PIN;
	gpio_spi2.GPIO_PinConfig.mode           = GPIO_MODE_ALTFN;
	gpio_spi2.GPIO_PinConfig.outType        = GPIO_OTYPE_PP;
	gpio_spi2.GPIO_PinConfig.puPdCtl        = GPIO_NO_PUPD;
	gpio_spi2.GPIO_PinConfig.speed          = GPIO_SPEED_HIGH;
    gpio_spi2.GPIO_PinConfig.altFuncMode    = SPI2_AF;
    GPIO_Init(&gpio_spi2);

    // SCLK
    gpio_spi2.GPIO_PinConfig.pinNumber = SPI2_SCLK_PIN;
	GPIO_Init(&gpio_spi2);

    // NSS
    gpio_spi2.GPIO_PinConfig.pinNumber  = SPI2_NSS_PIN;
    GPIO_Init(&gpio_spi2);
}

// Initializes GPIO pin for physical button
static void gpio_btn_init()
{
    GPIO_handle_t gpio_button;
	gpio_button.pGPIOx                      = BUTTON_PORT;
	gpio_button.GPIO_PinConfig.pinNumber    = BUTTON_PIN;
	gpio_button.GPIO_PinConfig.mode         = GPIO_MODE_IN;
	gpio_button.GPIO_PinConfig.puPdCtl      = GPIO_NO_PUPD;

	GPIO_Init(&gpio_button);
}

// Initializes SPI2 peripheral for TX
static void spi2_init(SPI_handle_t *spi2_handle)
{
    spi2_handle->pSPIx = SPI2;
    SPI_ConfigInit(&spi2_handle->SPI_Config);

    spi2_handle->SPI_Config.SPI_DeviceMode      = SPI_MODE_MASTER;
    spi2_handle->SPI_Config.SPI_BaudPrescaler   = SPI_BAUD_DIV8;    // 2MHz
    spi2_handle->SPI_Config.SPI_BusConfig       = SPI_BUS_FULL_DUPLEX;
    spi2_handle->SPI_Config.SPI_DFF 		    = SPI_DFF_8;
    spi2_handle->SPI_Config.SPI_CPOL            = SPI_CPOL_LOW;
    spi2_handle->SPI_Config.SPI_CPHA            = SPI_CPHA_FIRST_EDGE;
    spi2_handle->SPI_Config.SPI_SSM             = SPI_SSM_DI;

    SPI_Init(spi2_handle);
    SPI_PeripheralControl(SPI2, ENABLE);    // automatically makes NSS=0 when SSM=0
}

int main(void)
{    
    gpio_init();        // initialzes GPIO pins for SPI2 AltFN modes
    gpio_btn_init();    // initialzes GPIO pin for hardware button input

    SPI_handle_t spi2_handle;
    spi2_init(&spi2_handle);
    SPI_SSOEConfig(SPI2, ENABLE);   // enables SS output

    char msg[] = "Hello from STM32!";
    uint32_t len = sizeof(msg) - 1U;

    while(1)
    {
        while( !GPIO_ReadPin(BUTTON_PORT, BUTTON_PIN) );    // wait for button press
        delay(20000);                                       // debouncing
        if( !GPIO_ReadPin(BUTTON_PORT, BUTTON_PIN) )        // check if still pressed
            continue;

        while( GPIO_ReadPin(BUTTON_PORT, BUTTON_PIN) );     // wait for button release
        delay(20000);                                       // debouncing

        SPI_PeripheralControl(SPI2, ENABLE);                // enable spi2

        SPI_Send(spi2_handle.pSPIx, (uint8_t*)(&len), 1U);  // send length first
        SPI_Send(spi2_handle.pSPIx, (uint8_t*)msg, len);    // send payload

        while( SPI_GetFlag(SPI2, SPI_SR_BSY_BIT) );         // wait until not busy

        SPI_PeripheralControl(SPI2, DISABLE);               // disable spi2
    }
    
    return 0;
}
